Revit 2027 API
ParameterTypeId.PathReinSpanlengthBarlengthPrim Property
 "Length (Primary Bar)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinSpanlengthBarlengthPrim { get; }
Public Shared ReadOnly Property PathReinSpanlengthBarlengthPrim As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinSpanlengthBarlengthPrim {
	ForgeTypeId^ get ();
}
static member PathReinSpanlengthBarlengthPrim : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace